In [0]:
#Q2
import pandas as pd
data = {'cities' : ['lahore','karachi',], 'provinces' : ['punjab','sindh']}

# store data as DataFrame object. Assign object name as frame1
frame1 = pd.DataFrame(data)

# print frame
display(frame1)

    cities provinces
0   lahore    punjab
1  karachi     sindh

In [0]:
data2 = {"cities": ["islamabad","karachi","peshawar","quetta"],
         "provinces": ["capital","sindh", "KPK","Balochistan"]}
# store data as DataFrame object. Assign object name as frame2
frame2 = pd.DataFrame(data2)

display(frame2)

      cities    provinces
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

In [0]:
# combine both objects frame1 and frame2; without any duplicate rows and re-arrange all indexes
frame3 = pd.concat([frame1,frame2])# combine frame1 and frame2
frame3 = frame3.drop_duplicates().reset_index(drop=True) # remove duplicates rows
frame3 = frame3.sort_values(by="provinces",axis=0, ascending=True, inplace=False).reset_index(drop=True)# sort based on provinces
# frame3 = # re-arrange all indexes
display(frame3) # print frame3

      cities    provinces
0     quetta  Balochistan
1   peshawar          KPK
2  islamabad      capital
3     lahore       punjab
4    karachi        sindh

In [0]:
#Q3
table={
    "Name":["","Ali","Ahmed","Nida",""],
    "Field":["C","E","E","C","C"],
    "Age":None,
    "Marks":[-90,60,-10,70,75],
}
display(table)

{'Age': None,
 'Field': ['C', 'E', 'E', 'C', 'C'],
 'Marks': [-90, 60, -10, 70, 75],
 'Name': ['', 'Ali', 'Ahmed', 'Nida', '']}

In [0]:
data3 = pd.DataFrame(table)
display(data3)

    Name Field   Age  Marks
0            C  None    -90
1    Ali     E  None     60
2  Ahmed     E  None    -10
3   Nida     C  None     70
4            C  None     75

In [0]:
# Drop column Age as it does not contain any value
data3.drop(columns="Age",inplace=True)
display(data3)

    Name Field  Marks
0            C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4            C     75

In [0]:
# All empty strings in the Name column should be replaced by “---“
data3.replace(to_replace="",value="---",inplace=True)
display(data3)

    Name Field  Marks
0    ---     C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4    ---     C     75

In [0]:
# In the Field column replace “C” with 0 and “E” with 1. The column must contain
# only numeric values after this operation
data3.replace(to_replace="C",value=0,inplace=True)
data3.replace(to_replace="E",value=1,inplace=True)
display(data3)

    Name  Field  Marks
0    ---      0    -90
1    Ali      1     60
2  Ahmed      1    -10
3   Nida      0     70
4    ---      0     75

In [0]:
# Negative values are not permitted in Marks column. The invalid value in Marks
# column should be replaced with the average of all valid values in the same column
data3.Marks[data3.Marks < 0] = data3.Marks.mean()
display(data3)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    Name  Field  Marks
0    ---      0     21
1    Ali      1     60
2  Ahmed      1     21
3   Nida      0     70
4    ---      0     75